Revit 2024 API
IFCLinkDocumentExportScope Class
 A class that allows for the export of one linked document to IFC.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public class IFCLinkDocumentExportScope : IDisposable
Visual Basic
Public Class IFCLinkDocumentExportScope _
	Implements IDisposable
Visual C++
public ref class IFCLinkDocumentExportScope : IDisposable
Remarks
 Linked documents can only be exported within a transaction, but it is illegal to start a transaction for a linked document. This gives a special exception that does the work necessary to make sure that the host documents do not end up in unstable states after the export. This is not guaranteed for any other workflow. To ensure that the lifetime of the object is correctly managed, you should declare an instance of this class as a part of a 'using' statement in C# or similar construct in other lanuguages.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.IFC.IFCLinkDocumentExportScope
See Also
IFCLinkDocumentExportScope Members
Autodesk.Revit.DB.IFC Namespace